[
  {
    "author": "Stephanie",
    "cook_time_minutes": 25,
    "description": "I just started adding my favorite things to basic cornbread and I came up with something great!",
    "error": false,
    "footnotes": [],
    "ingredients": [
      "1/2 cup unsalted butter, chilled and cubed",
      "1 cup chopped onion",
      "1 3/4 cups cornmeal",
      "1 1/4 cups all-purpose flour",
      "1/4 cup white sugar",
      "1 tablespoon baking powder",
      "1 1/2 teaspoons salt",
      "1/2 teaspoon baking soda",
      "1 1/2 cups buttermilk",
      "3 eggs",
      "1 1/2 cups shredded pepperjack cheese",
      "1 1/3 cups frozen corn kernels, thawed and drained",
      "2 ounces roasted marinated red bell peppers, drained and chopped",
      "1/2 cup chopped fresh basil"
    ],
    "instructions": [
      "Preheat oven to 400 degrees F (205 degrees C). Butter a 9x9x2 inch baking pan.",
      "Melt 1 tablespoon butter in medium nonstick skillet over medium-low heat. Add onion and saute until tender, about 10 minutes. Cool.",
      "Mix cornmeal with the flour, baking powder, sugar, salt, and baking soda in large bowl. Add 7 tablespoons butter and rub with fingertips until mixture resembles coarse meal.",
      "Whisk buttermilk and eggs in medium bowl to blend. Add buttermilk mixture to dry ingredients and stir until blended. Mix in cheese, corn, red peppers, basil, and onion. Transfer to prepared pan.",
      "Bake cornbread until golden and tester inserted comes out clean, about 45 minutes. Cool 20 minutes in pan. Cut cornbread into squares."
    ],
    "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/582853.jpg",
    "prep_time_minutes": 55,
    "rating_stars": 4.32,
    "review_count": 46,
    "time_scraped": 1498204021,
    "title": "Basil, Roasted Peppers and Monterey Jack Cornbread",
    "total_time_minutes": 100,
    "url": "http://allrecipes.com/Recipe/6664/"
  },
  {
    "author": "Stephanie",
    "cook_time_minutes": 0,
    "description": "These are great as an appetizer or served alongside a meal!",
    "error": false,
    "footnotes": [],
    "ingredients": [
      "1/2 cup Parmesan cheese",
      "3/4 teaspoon ground black pepper",
      "1/2 teaspoon garlic powder",
      "1 (17.5 ounce) package frozen puff pastry, thawed",
      "1 egg white"
    ],
    "instructions": [
      "Combine parmesan cheese, pepper and garlic powder. Unfold pastry sheets onto cutting board. Brush lightly with egg white; sprinkle each sheet with 1/4 of the cheese mixture. Lightly press into pastry, turn over; repeat. Cut each sheet into 12 (1-inch) strips; twist.",
      "Place on ungreased cookie sheet and bake in 350 degrees F (175 degrees C) oven for 15 minutes or until golden brown."
    ],
    "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/69987.jpg",
    "prep_time_minutes": 0,
    "rating_stars": 4.18,
    "review_count": 44,
    "time_scraped": 1498204301,
    "title": "Crispy Cheese Twists",
    "total_time_minutes": 0,
    "url": "http://allrecipes.com/Recipe/6663/"
  },
  {
    "author": "Kathy",
    "cook_time_minutes": 0,
    "description": "This is the best bread recipe.  Light and fluffy rolls that melt in your mouth. Can be used to make loaves or cinnamon rolls.",
    "error": false,
    "footnotes": [],
    "ingredients": [
      "2 cups hot water",
      "1/2 cup margarine",
      "1/3 cup white sugar",
      "2 teaspoons salt",
      "1/2 cup cold water",
      "2 (.25 ounce) packages active dry yeast",
      "5 1/2 cups all-purpose flour",
      "2 eggs"
    ],
    "instructions": [
      "Melt margarine in hot water. Add sugar and salt and stir. Add cold water and yeast. Stir to dissolve yeast.",
      "Add 3 cups flour and mix. Add eggs and 2 1/2 - 3 cups more flour. Mix, cover and let rise until dough doubles in size.",
      "Punch down and let rise 30 more minutes or until doubles.",
      "Make walnut size balls of dough. Place about 2 inches apart in well-buttered 9 x 13 inch pan. Bake in a preheated 350 degrees F (175 degrees C) oven for 30-45 minutes. Brush top of rolls with margarine while hot."
    ],
    "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/5461.jpg",
    "prep_time_minutes": 0,
    "rating_stars": 3.65,
    "review_count": 168,
    "time_scraped": 1498206088,
    "title": "Mom's Yeast Rolls",
    "total_time_minutes": 0,
    "url": "http://allrecipes.com/Recipe/6665/"
  },
  {
    "author": "Mary E. Crain",
    "cook_time_minutes": 0,
    "description": "A Southern delight with a 'more-ish'  taste.  One bite and you want more! This bread freezes well.",
    "error": false,
    "footnotes": [],
    "ingredients": [
      "1 1/2 cups white sugar",
      "1/2 cup vegetable oil",
      "2 eggs",
      "1 3/4 cups sifted all-purpose flour",
      "1 teaspoon baking soda",
      "1/4 teaspoon salt",
      "1/2 teaspoon ground cinnamon",
      "1/2 teaspoon ground nutmeg",
      "1/3 cup water",
      "1 cup cooked and mashed sweet potatoes",
      "1/2 cup chopped pecans"
    ],
    "instructions": [
      "Combine sugar and oil; beat well. Add eggs and beat. Combine flour, baking soda, salt, cinnamon and nutmeg. Stir flour mixture into egg mixture alternately with water. Stir in sweet potatoes and chopped nuts.",
      "Pour batter into greased 9x5 inch loaf pan (or 2 small loaf pans). Bake at 350 degrees F (175 degrees C) for about one hour."
    ],
    "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/394676.jpg",
    "prep_time_minutes": 0,
    "rating_stars": 4.7,
    "review_count": 344,
    "time_scraped": 1498209193,
    "title": "Sweet Potato Bread I",
    "total_time_minutes": 0,
    "url": "http://allrecipes.com/Recipe/6666/"
  },
  {
    "author": "DeeDee",
    "cook_time_minutes": 45,
    "description": "You can make these into braids or buns. Frost with an orange icing and sprinkle some nuts on top, if desired.",
    "error": false,
    "footnotes": [
      "Cook's Note:",
      "I made 1 braid, 12 cinnamon buns, and 12 butterhorns with this recipe.",
      "Parchment can be used for easier cleanup/removal from the pan."
    ],
    "ingredients": [
      "1/4 cup butter",
      "1 teaspoon white sugar",
      "1 cup hot milk",
      "2 tablespoons active dry yeast",
      "6 cups bread flour, divided",
      "1/2 cup white sugar",
      "2 eggs",
      "1 cup orange juice",
      "1 tablespoon orange zest",
      "1 teaspoon salt"
    ],
    "instructions": [
      "Stir butter and 1 teaspoon sugar into the hot milk until butter is melted. When mixture is lukewarm, stir in yeast and set aside for 5 minutes.",
      "When mixture is creamy, transfer to a large mixing bowl. Mix in 2 cups of bread flour. Add 1/2 cup sugar, eggs, orange juice, orange zest, and salt and beat until combined. Add remaining flour, mixing well after each addition, until it pulls away from the sides of the bowl.",
      "Knead for about 10 minutes. Transfer dough to a greased bowl, cover with plastic wrap, and let rise until doubled, about 1 hour. If time permits, you can punch dough down, cover it, and let it rise again.",
      "Transfer dough to a lightly floured work surface. Cut dough into 3 balls, cover with plastic wrap, and let rest for 10 minutes.",
      "Preheat oven to 375 degrees F (190 degrees C). Lightly grease two baking sheets or line with parchment paper.",
      "Shape each piece of dough into braided loaves or buns; place on baking sheets. Let rise until doubled, about 30 minutes.",
      "Bake until rolls or loaves are golden brown, 10 to 12 minutes for individual buns, about 20 minutes for braids. Frost rolls, if desired (see Cook's Note) or sprinkle with confectioners' sugar."
    ],
    "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4499841.jpg",
    "prep_time_minutes": 20,
    "rating_stars": 4.71,
    "review_count": 6,
    "time_scraped": 1498205251,
    "title": "Orange Buns",
    "total_time_minutes": 170,
    "url": "http://allrecipes.com/Recipe/6668/"
  },
  {
    "author": "Linda Jackman",
    "cook_time_minutes": 0,
    "description": "Delicious!  This recipe originated in Cornwall, England.",
    "error": false,
    "footnotes": [],
    "ingredients": [
      "1 teaspoon active dry yeast",
      "1 1/4 cups lukewarm milk",
      "1 tablespoon white sugar",
      "3 cups unbleached all-purpose flour",
      "1/4 teaspoon salt",
      "2 tablespoons butter, melted and cooled"
    ],
    "instructions": [
      "In a small bowl, dissolve the yeast in the milk and add the sugar. In another bowl, sift the flour and salt together and add the cooled melted butter.",
      "Add the yeast mixture to the flour mixture, and turn out onto a floured counter and knead until the dough is smooth and elastic. Place the dough in an oiled bowl, cover with a clean towel and let rise in a warm, draft free place to 45 minutes.",
      "Turn dough out onto the freshly floured board and shape into 9 balls. Place dough balls into a buttered and floured 9 inch square pan. Let them sit, covered for another 15 minutes to rise again. Preheat the oven to 425 degrees F (220 degrees C).",
      "Bake for 15-20 minutes until browned and puffed. Split open and serve warm."
    ],
    "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1843306.jpg",
    "prep_time_minutes": 0,
    "rating_stars": 4.33,
    "review_count": 88,
    "time_scraped": 1498205958,
    "title": "Cornish Splits",
    "total_time_minutes": 0,
    "url": "http://allrecipes.com/Recipe/6667/"
  }
]